# Employee Attrition

## Problem Statement
- We Want to predict who among our employees is likely to leave

In [26]:
#Import packages
import pandas as pd

In [27]:
df=pd.read_csv("C:/Users/VARATHAMOHAN/StreamLit_Files/streamlit_emp_pred-main/streamlit_emp_pred-main/emp_analytics.csv")

In [28]:
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [29]:
df.shape

(14999, 10)

In [30]:
df.isnull().sum()

satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
left                     0
promotion_last_5years    0
Department               0
salary                   0
dtype: int64

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   satisfaction_level     14999 non-null  float64
 1   last_evaluation        14999 non-null  float64
 2   number_project         14999 non-null  int64
 3   average_montly_hours   14999 non-null  int64
 4   time_spend_company     14999 non-null  int64
 5   Work_accident          14999 non-null  int64
 6   left                   14999 non-null  int64
 7   promotion_last_5years  14999 non-null  int64
 8   Department             14999 non-null  object
 9   salary                 14999 non-null  object
dtypes: float64(2), int64(6), object(2)
memory usage: 1.1+ MB

satisfaction_Level:
Satisfaction level of employee in percentage. 100% or 1 is very satisfied. 0% or 0 is not satisfied

Last_evalution:
Time from last evalution in years

number_project
Number of projects an employee is working on

average monthly_hours
Average hours worked by employee in last 3 months

time_spend_company
Time spend my employee commuting to office

Work_accident
If the employee was involved in a work accident

Left 
If the employee has left the company

Promotion_in_last_5_yrs
If the employee has a promotion in past 5 years

Department
Department employee is working in

Salary

## Feature Engineering

In [32]:
df.groupby('left').mean()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years
left,,,,,,,
0,0.666810,0.715473,3.786664,199.060203,3.380032,0.175009,0.026251
1,0.440098,0.718113,3.855503,207.419210,3.876505,0.047326,0.005321

In [33]:
df.salary.value_counts()

low       7316
medium    6446
high      1237
Name: salary, dtype: int64

In [34]:
pd.get_dummies(df.salary)

       high  low  medium
0         0    1       0
1         0    0       1
2         0    0       1
3         0    1       0
4         0    1       0
...     ...  ...     ...
14994     0    1       0
14995     0    1       0
14996     0    1       0
14997     0    1       0
14998     0    1       0

[14999 rows x 3 columns]

In [35]:
df.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium
3,0.72,0.87,5,223,5,0,1,0,sales,low
4,0.37,0.52,2,159,3,0,1,0,sales,low

In [36]:
subdf = df[['satisfaction_level','average_montly_hours','promotion_last_5years','salary','left']]
subdf.head()

,satisfaction_level,average_montly_hours,promotion_last_5years,salary,left
0,0.38,157,0,low,1
1,0.80,262,0,medium,1
2,0.11,272,0,medium,1
3,0.72,223,0,low,1
4,0.37,159,0,low,1

In [37]:
subdf.columns

Index(['satisfaction_level', 'average_montly_hours', 'promotion_last_5years',
       'salary', 'left'],
      dtype='object')

In [38]:
salaries_dummies=pd.get_dummies(subdf.salary,prefix="salary")

In [39]:
salaries_dummies

       salary_high  salary_low  salary_medium
0                0           1              0
1                0           0              1
2                0           0              1
3                0           1              0
4                0           1              0
...            ...         ...            ...
14994            0           1              0
14995            0           1              0
14996            0           1              0
14997            0           1              0
14998            0           1              0

[14999 rows x 3 columns]

In [40]:
##concatenation - merge columns
df=pd.concat([subdf,salaries_dummies],axis='columns')

In [41]:
df.sample(20)

,satisfaction_level,average_montly_hours,promotion_last_5years,salary,left,salary_high,salary_low,salary_medium
9371,0.93,154,0,low,0,0,1,0
2326,0.56,212,0,medium,0,0,0,1
1762,0.41,205,0,low,1,0,1,0
2033,0.75,175,0,low,0,0,1,0
14930,0.11,268,0,medium,1,0,0,1
10244,0.97,147,0,medium,0,0,0,1
13571,0.62,165,0,medium,0,0,0,1
11711,0.82,215,0,high,0,1,0,0
7279,0.46,148,0,low,0,0,1,0
7183,0.91,257,0,medium,0,0,0,1
9848,0.71,207,0,medium,0,0,0,1
12367,0.40,131,0,low,1,0,1,0
10323,0.73,166,0,high,0,1,0,0
13967,0.44,141,1,high,0,1,0,0
8903,0.65,189,0,low,0,0,1,0
6877,0.74,255,0,medium,0,0,0,1
8245,0.50,192,0,low,0,0,1,0
346,0.81,253,0,low,1,0,1,0
10327,0.64,269,0,medium,0,0,0,1
2367,0.64,166,0,medium,0,0,0,1

Now we need to remove salary column which is text data. It is already replaced by dummy variables so we can safely remove it

In [42]:
df.drop('salary',inplace=True,axis='columns')

In [43]:
df.sample(5)

,satisfaction_level,average_montly_hours,promotion_last_5years,left,salary_high,salary_low,salary_medium
1494,0.17,188,0,1,0,1,0
3693,0.59,141,0,0,0,0,1
3746,0.91,167,0,0,0,0,1
8656,0.32,157,0,0,0,1,0
2493,0.40,214,0,0,0,0,1

In [44]:
X=df.drop('left',axis='columns')

In [45]:
X.head()

,satisfaction_level,average_montly_hours,promotion_last_5years,salary_high,salary_low,salary_medium
0,0.38,157,0,0,1,0
1,0.80,262,0,0,0,1
2,0.11,272,0,0,0,1
3,0.72,223,0,0,1,0
4,0.37,159,0,0,1,0

In [46]:
y=df[['left']]

In [47]:
y

       left
0         1
1         1
2         1
3         1
4         1
...     ...
14994     1
14995     1
14996     1
14997     1
14998     1

[14999 rows x 1 columns]

In [48]:
y.value_counts()

left
0       11428
1        3571
dtype: int64

## Imbalanced dataset

## SMOTE -Synthetic Minority Oversampling Technique

In [49]:
### Install
# !pip install imbalanced-learn

In [50]:
from imblearn.over_sampling import SMOTE

ModuleNotFoundError: No module named 'imblearn'

In [ ]:
sm=SMOTE(random_state=42)

In [ ]:
X,y=sm.fit_resample(X,y)

In [ ]:
y.value_counts()

In [ ]:
y

In [ ]:
X

In [ ]:
y.shape

In [ ]:
X.shape

### Split Dataset

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3)

In [ ]:
X_train.shape

In [ ]:
y_train.shape

In [ ]:
X_test.shape

In [ ]:
y_test.shape

In [ ]:
y_test

In [ ]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

In [ ]:
model.fit(X_train, y_train)

In [ ]:
y_pred=model.predict(X_test)

In [ ]:
y_pred

In [ ]:
model.score(X_test,y_test)

Our model is 73% accurate

In [ ]:
import matplotlib.pyplot as plt # for plotting graphs
#import module
from sklearn.cluster import KMeans

data =pd.read_csv("C:/Users/VARATHAMOHAN/StreamLit_Files/streamlit_emp_pred-main/streamlit_emp_pred-main/emp_analytics.csv")

# Filter df
left_emp =  data[['satisfaction_level', 'last_evaluation']][data.left == 1]

# Create groups using K-means clustering.
kmeans = KMeans(n_clusters = 3, random_state = 0).fit(left_emp)

# Add new column "label" annd assign cluster labels.
left_emp['label'] = kmeans.labels_

# Draw scatter plot
plt.scatter(left_emp['satisfaction_level'], left_emp['last_evaluation'], c=left_emp['label'],cmap='Accent')
plt.xlabel('Satisfaction Level')
plt.ylabel('Last Evaluation')
plt.title('3 Clusters of employees who left')
plt.show()

## Evaluate Errors

In [ ]:
from sklearn.metrics import classification_report

In [ ]:
print(classification_report(y_test, y_pred))

In [ ]:
#confusion Matrix
from sklearn.metrics import confusion_matrix

In [ ]:
cm=confusion_matrix(y_test,y_pred)

In [ ]:
cm

In [ ]:
# Import scikit-learn metrics module for accuracy calculation
from sklearn import metrics
# Model Accuracy, how often is the classifier correct?
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))
# Model Precision
print("Precision:",metrics.precision_score(y_test, y_pred))
# Model Recall
print("Recall:",metrics.recall_score(y_test, y_pred))

In [ ]:
### Create a Pickle file using serialization 
import pickle
pickle_out = open("C:/Users/VARATHAMOHAN/StreamLit_Files/streamlit_emp_pred-main/streamlit_emp_pred-main/emp-model.pkl","rb")
pickle.dump(model, pickle_out)
pickle_out.close()